In [30]:
import pandas as pd

In [31]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [4]:
# data=[4,8,15,16,23,42]
data=pd.Series([4,8,15,16,23,42])
data

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [10]:
LIST=["ANJALI","RAVI","NATISH","SATISH","ROHINI","MOHINI","TINA","RITU","AVIKA","SIRAT"]
data1=pd.Series(LIST)
data1

0    ANJALI
1      RAVI
2    NATISH
3    SATISH
4    ROHINI
5    MOHINI
6      TINA
7      RITU
8     AVIKA
9     SIRAT
dtype: object

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [27]:
 frame={'name':['Alice','Bob','Claire'],
       'age':[25,30,27],
       'Gender':['Female','Male','Female']}
df=pd.DataFrame(frame)
df

     name  age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4.  What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [ ]:
Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [ ]:
Pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.).

In [19]:
#series example: 
#1)
num=[1,2,3,5,0,9]
n=pd.Series(num)
print(n)
#2)
dic={"name":['Anju','Monika',"shruti","tina"] ,' id':[4,6,8,9]}
n2=pd.Series(dic)
n2

0    1
1    2
2    3
3    5
4    0
5    9
dtype: int64

name    [Anju, Monika, shruti, tina]
 id                     [4, 6, 8, 9]
dtype: object

In [23]:
#dataframe example:
#1)
nums=[67.6,89.0,56.6,90.9,23.7]
n1=pd.DataFrame(nums)
n1

      0
0  67.6
1  89.0
2  56.6
3  90.9
4  23.7

In [24]:
#2)
di={"name":['Anju','Monika',"shruti","tina"] ,' id':[4,6,8,9]}
na=pd.DataFrame(di)
na

     name   id
0    Anju    4
1  Monika    6
2  shruti    8
3    tina    9

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [ ]:
read_csv(): read a comma-separated values (csv) file into a Pandas DataFrame.
head(): return the first n rows of a dataset.
describe(): return a statistical summary of the dataset.
memory_usage(): return the memory usage of each column in bytes.
astype(): cast a pandas object to a specified dtype.
loc[:]: access a group of rows and columns by label(s) or a boolean array.
to_datetime(): convert argument to datetime.
value_counts(): return a Series containing counts of unique values.

In [29]:
#example of head function
na.head(2)
# this function read first 2 rows

     name   id
0    Anju    4
1  Monika    6

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
All three data structures, Series, DataFrame, and Panel are value mutable (can be changed). However, 
only DataFrame and Panel are size mutable Series is size immutable.

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [26]:
author=["jatin","Suryavanshi","Prakash","Dinanath"]
article=[210,345,328,908]
ar_series=pd.Series(author)
a_series=pd.Series(article)
frame = {'Author': ar_series,
         'Article': a_series}
result = pd.DataFrame(frame)
result

        Author  Article
0        jatin      210
1  Suryavanshi      345
2      Prakash      328
3     Dinanath      908